//  Они все кричат 10 потому, что по окончанию цикла i остается в значении 10,
//  а так как каждый элемент students содержит alert( i ), а не от числа, то любой вызов
//  обернется "выкриком" числа 10. Замыкание же!

function makeLine() {

    var students = [];

    for (var i = 0; i < 10; i++) {
        var tmp = i;
        var student = function() { // функция-ученик
            alert( tmp ); // кричит свой номер
        };
        students.push(student);
    }

    return students;
}

var line = makeLine();

line[0](); // ученик кричит 10, а должен 0
line[5](); // ученик по-прежнему кричит 10..., а должен 5
// .. все ученики кричат 10 вместо 0,1,2...9